# St7MorphEdges

Morphs the selected edges of geometry faces.

long St7MorphEdges(long uID)

Input Parameters

uID

Strand7 model file ID.

Dependencies
Selection

Entities can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.

Global Parameters

ivEdgesMorphed.